# DividedSurfaceSplitManagerProblem1dNonWPCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..DividedSurfaceSplitManagerProblem1dNonWPCurve Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
Divided Surface cannot be split by a one dimensional curve without workplane
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedSurfaceSplitManagerProblem1dNonWPCurve { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceSplitManagerProblem1dNonWPCurve As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedSurfaceSplitManagerProblem1dNonWPCurve {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace